## Data Frame Avanzado

In [25]:
import pandas as pd

In [26]:
stocks = pd.read_csv('http://bit.ly/smallstocks', parse_dates = ['Date'])

In [27]:
stocks

        Date   Close    Volume Symbol
0 2016-10-03   31.50  14070500   CSCO
1 2016-10-03  112.52  21701800   AAPL
2 2016-10-03   57.42  19189500   MSFT
3 2016-10-04  113.00  29736800   AAPL
4 2016-10-04   57.24  20085900   MSFT
5 2016-10-04   31.35  18460400   CSCO
6 2016-10-05   57.64  16726400   MSFT
7 2016-10-05   31.59  11808600   CSCO
8 2016-10-05  113.05  21453100   AAPL

### Trabajando con Indices

In [28]:
stocks.set_index(['Date'], inplace = True)

In [29]:
stocks.index

DatetimeIndex(['2016-10-03', '2016-10-03', '2016-10-03', '2016-10-04',
               '2016-10-04', '2016-10-04', '2016-10-05', '2016-10-05',
               '2016-10-05'],
              dtype='datetime64[ns]', name='Date', freq=None)

In [30]:
stocks.loc['2016-10-03']

             Close    Volume Symbol
Date
2016-10-03   31.50  14070500   CSCO
2016-10-03  112.52  21701800   AAPL
2016-10-03   57.42  19189500   MSFT

### Group By y agregaciones

In [31]:
sgb = stocks.groupby(['Symbol', 'Date']).sum()

In [32]:
sgb.loc[sgb['Volume'] > 10]

                    Close    Volume
Symbol Date
AAPL   2016-10-03  112.52  21701800
       2016-10-04  113.00  29736800
       2016-10-05  113.05  21453100
CSCO   2016-10-03   31.50  14070500
       2016-10-04   31.35  18460400
       2016-10-05   31.59  11808600
MSFT   2016-10-03   57.42  19189500
       2016-10-04   57.24  20085900
       2016-10-05   57.64  16726400

In [33]:
stocks.groupby(['Symbol', 'Date']).sum().loc[lambda df:df['Volume']>10]

                    Close    Volume
Symbol Date
AAPL   2016-10-03  112.52  21701800
       2016-10-04  113.00  29736800
       2016-10-05  113.05  21453100
CSCO   2016-10-03   31.50  14070500
       2016-10-04   31.35  18460400
       2016-10-05   31.59  11808600
MSFT   2016-10-03   57.42  19189500
       2016-10-04   57.24  20085900
       2016-10-05   57.64  16726400

In [34]:
sgb.describe()

            Close        Volume
count    9.000000  9.000000e+00
mean    67.256667  1.924811e+07
std     35.999591  5.132421e+06
min     31.350000  1.180860e+07
25%     31.590000  1.672640e+07
50%     57.420000  1.918950e+07
75%    112.520000  2.145310e+07
max    113.050000  2.973680e+07

In [35]:
sgb.agg(['sum', 'max', 'average'])

              Close        Volume
sum      605.310000  1.732330e+08
max      113.050000  2.973680e+07
average   67.256667  1.924811e+07

In [36]:
grpFrame = sgb.Close.agg(['min', 'max', 'mean'])

In [37]:
grpFrame

min      31.350000
max     113.050000
mean     67.256667
Name: Close, dtype: float64

### Stack y Unstack

In [38]:
grpFrame.unstack()

AttributeError: 'Index' object has no attribute 'remove_unused_levels'

In [39]:
df = stocks.pivot_table(values = 'Close', index = 'Symbol', columns = 'Date')
df

Date    2016-10-03  2016-10-04  2016-10-05
Symbol
AAPL        112.52      113.00      113.05
CSCO         31.50       31.35       31.59
MSFT         57.42       57.24       57.64

In [41]:
grpFrame

min      31.350000
max     113.050000
mean     67.256667
Name: Close, dtype: float64

In [42]:
grpFrame.loc[(slice(None), '2016-10-03'), :]

IndexingError: Too many indexers

In [43]:
grpFrame.index

Index(['min', 'max', 'mean'], dtype='object')

# Merge, Combine, Concat (buscarV :)

In [44]:
dfP = pd.read_excel('Siniestros.xlsx', sheet_name = 'Clientes', index_col = 'Cliente')
dfP

                   Nombre Sexo       Fnac
Cliente
35874773   Rafael Harispe    M 1971-02-05
17477171  Silvana Collazo    F 1980-01-01

In [45]:
dfTS = pd.read_excel('Siniestros.xlsx', sheet_name = 'TiposSin', index_col = 'Tipo')
dfTS

        Descripcion
Tipo
A         Accidente
F     Fallecimiento
R              Robo

In [46]:
dfS = pd.read_excel('Siniestros.xlsx', index_col = 'NroSiniestro')
dfS2 = pd.read_excel('Siniestros.xlsx', sheet_name = 'MasSiniestros', index_col = 'NroSiniestro')
print(dfS)
print(dfS2)

              NroCliente FechaDeclaracion TipoSiniestro  MontoReclamado  \
NroSiniestro
102030          35874773       2019-01-15             M          150000
453242          17477171       2019-07-03             R           10000
123123          35874773       2019-01-15             M          150000

              MontoPago
NroSiniestro
102030           150000
453242              500
123123           150001
              NroCliente FechaDeclaracion TipoSiniestro  MontoReclamado  \
NroSiniestro
123123          35874773       2019-01-15             M          150000
678678          17477171       2019-07-03             R           10000

              MontoPago
NroSiniestro
123123               10
678678               20

## Concat

In [47]:
dfTodos = pd.concat([dfS, dfS2])
dfTodos

,NroCliente,FechaDeclaracion,TipoSiniestro,MontoReclamado,MontoPago
NroSiniestro,,,,,
102030,35874773,2019-01-15,M,150000,150000
453242,17477171,2019-07-03,R,10000,500
123123,35874773,2019-01-15,M,150000,150001
123123,35874773,2019-01-15,M,150000,10
678678,17477171,2019-07-03,R,10000,20

In [48]:
dfTodos

,NroCliente,FechaDeclaracion,TipoSiniestro,MontoReclamado,MontoPago
NroSiniestro,,,,,
102030,35874773,2019-01-15,M,150000,150000
453242,17477171,2019-07-03,R,10000,500
123123,35874773,2019-01-15,M,150000,150001
123123,35874773,2019-01-15,M,150000,10
678678,17477171,2019-07-03,R,10000,20

## Merege

In [50]:
dfTodos2 = pd.merge(dfTodos, dfP, left_on = 'NroCliente', right_on = 'Cliente', indicator = True)
dfTodos2

,NroCliente,FechaDeclaracion,TipoSiniestro,MontoReclamado,MontoPago,Nombre,Sexo,Fnac,_merge
0,35874773,2019-01-15,M,150000,150000,Rafael Harispe,M,1971-02-05,both
1,35874773,2019-01-15,M,150000,150001,Rafael Harispe,M,1971-02-05,both
2,35874773,2019-01-15,M,150000,10,Rafael Harispe,M,1971-02-05,both
3,17477171,2019-07-03,R,10000,500,Silvana Collazo,F,1980-01-01,both
4,17477171,2019-07-03,R,10000,20,Silvana Collazo,F,1980-01-01,both

In [70]:
import numpy as np
dfTodos.loc[:, ['MontoReclamado', 'MontoPago']].apply(np.argmax)

MontoReclamado    102030
MontoPago         123123
dtype: int64

In [53]:
dfTodos.loc[:, ['MontoReclamado', 'MontoPago']].apply(max, axis = 1)

NroSiniestro
102030    150000
453242     10000
123123    150001
123123    150000
678678     10000
dtype: int64

In [54]:
dfTodos.loc[dfTodos.MontoPago.idxmax()]

,NroCliente,FechaDeclaracion,TipoSiniestro,MontoReclamado,MontoPago
NroSiniestro,,,,,
123123,35874773,2019-01-15,M,150000,150001
123123,35874773,2019-01-15,M,150000,10

## Apply, Map, ApplyMap

In [272]:
dfP

                   Nombre Sexo       Fnac
Cliente
35874773   Rafael Harispe    M 1971-02-05
17477171  Silvana Collazo    F 1980-01-01

In [271]:
dfP.Sexo.map({'M':'Masculino', 'F': 'Mujer'})

Cliente
35874773    Masculino
17477171        Mujer
Name: Sexo, dtype: object

In [172]:
import numpy as np
df = pd.DataFrame([[4, 9]] * 3, columns=['A', 'B'])
df

   A  B
0  4  9
1  4  9
2  4  9

In [173]:
df.apply(np.sqrt)

     A    B
0  2.0  3.0
1  2.0  3.0
2  2.0  3.0

In [175]:
df.apply(np.sum, axis = 0)

A    12
B    27
dtype: int64

In [174]:
df.apply(np.sum, axis = 1)

0    13
1    13
2    13
dtype: int64

In [297]:
miSerie = df.A
miSerie.agg(['max', 'mean'])

max     4.0
mean    4.0
Name: A, dtype: float64

In [301]:
def f(x):
    print(type(x))
    print(x)
    
df.apply(f)

<class 'pandas.core.series.Series'>
0    4
1    4
2    4
Name: A, dtype: int64
<class 'pandas.core.series.Series'>
0    9
1    9
2    9
Name: B, dtype: int64
<class 'pandas.core.series.Series'>
0    36
1    36
2    36
Name: C, dtype: int64

A    None
B    None
C    None
dtype: object

In [311]:
print(df)
df.apply(lambda x: x.max() if x.max() > 10 else 0)

   A  B   C
0  4  9  36
1  4  9  36
2  4  9  36

A     0
B     0
C    36
dtype: int64

In [180]:
df

   A  B
0  4  9
1  4  9
2  4  9

In [188]:
df['C'] = df.apply(lambda x: f(x), axis = 1)

In [189]:
df

   A  B   C
0  4  9  36
1  4  9  36
2  4  9  36